Repository: kingrpaul/eo-glossary
Catalog: tm/the-hanging-stranger_en_eo.tmx
Source language: en
Languages: eo

source: “Get down here, both of you.”
eo: “Malsupriĝu ĉi tien, vi ambaŭ.”

source: Tommy appeared at the top of the stairs.
eo: Tomaso aperis ĉe la supro de la ŝtuparo.

source: “I was doing my home work.
eo: “Mi estis faranta mian hejmtaskojn.

source: We’re starting fractions.
eo: Ni komencas frakciojn.

source: Miss Parker says if we don’t get this done⁠—”
eo: Fraŭlino Parkero diras, se ni ne kompletos ĉi tion⁠—”

source: “You can forget about fractions.” Ed grabbed his son as he came down the stairs and propelled him toward the door.
eo: “Vi povas forgesi pri frakciojn.” Edo ekprenis lian filon dum li venis malsupre la ŝtuparoj kaj propulsis lin al la pordo.

source: “Where’s Jim?”
eo: “Kie estas Jimo?”

source: “He’s coming.”
eo: “Li venas.”

source: Jim started slowly down the stairs.
eo: Jimo komencis iri malrapide malsupren laŭ la ŝtuparo.

source: “What’s up, Dad?”
eo: “Kio okazas, paĉjo?”

source: “We’re going for a ride.”
eo: “Ni iros por rajdo.”

source: “A ride?
eo: “Rajdo?

source: Where?”
eo: Kien?”

source: Ed turned to Janet.
eo: Edo turniĝis al Janeto.

source: “We’ll leave the lights on.
eo: “Ni lasos la lumojn ŝaltitajn.

source: And the TV set.
eo: Kaj la televidilo.

source: Go turn it on.” He pushed her toward the set.
eo: Iru por ŝalti ĝin.” Li puŝis ŝin al la televidilo.

source: “So they’ll think we’re still⁠—”
eo: “Tiel ili kredos ke ni ankoraŭ estas⁠—”

source: He heard the buzz.
eo: Li audis la zumado.

source: And dropped instantly, the long butcher knife out.
eo: Kaj faliĝis tuje, la longa viandista tranĉilo ekstere.

source: Sickened, he saw it coming down the stairs at him, wings a blur of motion as it aimed itself.
eo: Ekmalsaniĝa, li vidis ĝin venanta malsupre la ŝtaroj al li, fluĝiloj malklaraĵo de movado dum ĝi celis sin mem.

source: It still bore a vague resemblance to Jimmy.
eo: Ĝi ankoraŭ svage similis Jimeno.

source: It was small, a baby one.
eo: Ĝi estis malgranda, beba oni.

source: A brief glimpse⁠—the thing hurtling at him, cold, multi-lensed inhuman eyes.
eo: Mallonga ekvido⁠—la aferaĉo impetanta al li, malvarma, multa lensa nehoma okuloj.

source: Wings, body still clothed in yellow T-shirt and jeans, the mimic outline still stamped on it.
eo: Flugiloj, korpo ankoraŭ vestita en flava T-ĉemizo kaj ĝinzo, la mimika konturo ankoraŭ stampita sur ĝi.

source: A strange half-turn of its body as it reached him.
eo: Stranga duona turno de ĝia korpo, kiam ĝi atingis lin.

source: What was it doing?
eo: Kio ĝi faris?

source: A stinger.
eo: Pikilo.

source: Loyce stabbed wildly at it.
eo: Lojso ponardis sovaĝe al ĝi.

source: It retreated, buzzing frantically.
eo: Ĝi retiriĝis, zumanta freneze.

source: Loyce rolled and crawled toward the door.
eo: Lojso ruliĝis kaj rampis al la pordo.

source: Tommy and Janet stood still as statues, faces blank.
eo: Tomaso kaj Janeto staris senmove kiel statuoj, vizaĝoj malpenaj.

source: Watching without expression.
eo: Rigardanta sen esprimo.

source: Loyce stabbed again.
eo: Lojso ponardis denove.

source: This time the knife connected.
eo: Ĉi foje la tranĉilo ligis.

source: The thing shrieked and faltered.
eo: La aferaĉo kriĉis kaj ŝanceliĝis.

source: It bounced against the wall and fluttered down.
eo: Ĝi resaltis kontraŭ la muro kaj flirtis malsupren.

source: Something lapped through his mind.
eo: Io plaŭdis tra lia menso.

source: A wall of force, energy, an alien mind probing into him.
eo: Muro el forto, energio, eksterterana menso sondanta en li.

source: He was suddenly paralyzed.
eo: Li estis paraliziĝinta subite.

source: The mind entered his own, touched against him briefly, shockingly.
eo: La menso eniris lian mem, tuŝis kontraŭ lin mallonge, ŝoke.

source: An utterly alien presence, settling over him⁠—and then it flickered out as the thing collapsed in a broken heap on the rug.
eo: Tute eksterterana ĉeesto, ekloĝanta super lin⁠—kaj tiam ĝi flagre estingiĝis, kiam la aferaĉo kolapsis en rompa amasaĉo sur la tapiŝo.

source: It was dead.
eo: Ĝi estis morta.

source: He turned it over with his foot.
eo: Li turnis ĝin per sia piedo.

source: It was an insect, a fly of some kind.
eo: Ĝi estis insekto, muŝo ia.

source: Yellow T-shirt, jeans.
eo: Flava T-ĉemizo, ĝinzo.

source: His son Jimmy.⁠ ⁠… He closed his mind tight.
eo: Lia filo Jimeno.⁠ ⁠… Li fermis lian menson streĉan.

source: It was too late to think about that.
eo: Estas tro malfrue por pripensi tion.

source: Savagely he scooped up his knife and headed toward the door.
eo: Sovaĝe li prenis supren lia tranĉilo kaj ekiris al la pordo.

source: Janet and Tommy stood stone-still, neither of them moving.
eo: Janeto kaj Tomaso staris nemova kiel ŝtono, neniu el ili movanta.

source: The car was out.
eo: La aŭto estis ekstere.

source: He’d never get through.
eo: Li povus trapasi neniam.

source: They’d be waiting for him.
eo: Ili estus atendi por li.

source: It was ten miles on foot.
eo: Estis dek mejloj piede.

source: Ten long miles over rough ground, gulleys and open fields and hills of uncut forest.
eo: Dek longaj mejloj super malglata tero, ravinetoj kaj malfermaj kampoj kaj montetoj de netranĉita arbaro.

source: He’d have to go alone.
eo: Li devos iri unuope.

source: Loyce opened the door.
eo: Lojso malfermis la pordon.

source: For a brief second he looked back at his wife and son.
eo: Dum mallonga sekundeto, li rerigaris al sian edzino kaj filo.

source: Then he slammed the door behind him and raced down the porch steps.
eo: Poste, li fermis brue la pordon malantaŭ si kaj kuregis malsupren laŭ la de la verando-ŝtupoj.

source: A moment later he was on his way, hurrying swiftly through the darkness toward the edge of town.
eo: Momento poste li estis survoje, rapidanta rapide tra la mallumo al la rando de la urbeto.

source: The early morning sunlight was blinding.
eo: La frua matena sunlumo estis blindiga.

source: Loyce halted, gasping for breath, swaying back and forth.
eo: Lojso haltis, anhelanta por spiro, ŝancelanta tien kaj reen.

source: Sweat ran down in his eyes.
eo: Ŝvito kuris malsupre en lian okulojn.

source: His clothing was torn, shredded by the brush and thorns through which he had crawled.
eo: Lia vestaĝoj estis ŝirita, disŝirita per la subarbusto kaj dornoj tra tio li estis rampinta.

source: Ten miles⁠—on his hands and knees.
eo: Dek mejloj⁠—sur lia manoj kaj genuoj.

source: Crawling, creeping through the night.
eo: Rampante, krablanta dum la nokto.

source: His shoes were mud-caked.
eo: Liaj ŝuoj estis kukitaj per koto.

source: He was scratched and limping, utterly exhausted.
eo: Li estis gratita kaj lamanta, tute lacega.

source: But ahead of him lay Oak Grove.
eo: Sed antaŭ li estis Kverka Arbareto.

source: He took a deep breath and started down the hill.
eo: Li prenis profundan spiron kaj komencis malsupren laŭ la monteto.

source: Twice he stumbled and fell, picking himself up and trudging on.
eo: Dufoje li stumblis kaj falis, tiranta sin supren kaj marŝanta plu.

source: His ears rang.
eo: Lia oreloj sonoris.

source: Everything receded and wavered.
eo: Ĉio retiriĝis kaj ŝanceliĝis.

source: But he was there.
eo: Sed li estis tie.

source: He had got out, away from Pikeville.
eo: Li estis eliginta, for de Pikurbeto.

source: A farmer in a field gaped at him.
eo: Farmanto en kampo gapis al li.

source: From a house a young woman watched in wonder.
eo: De domo juna virino rimarkis mire.

source: Loyce reached the road and turned onto it.
eo: Lojso atingis la vojo kaj turniĝis sur ĝin.

source: Ahead of him was a gasoline station and a drive-in.
eo: Antaŭ lin estis benzinstacio kaj parkokinejo.

source: A couple of trucks, some chickens pecking in the dirt, a dog tied with a string.
eo: Paro da kamionoj, iom da kokoj bekantaj en la grundo, hundo ligita per ŝnureto.

source: The white-clad attendant watched suspiciously as he dragged himself up to the station.
eo: La blanka vestita servisto rigardis malfide tiam li trenis sin mem supre al la stacio.

source: “Thank God.” He caught hold of the wall.
eo: “Dankas al Dio.” Li kaptis la muron.

source: “I didn’t think I was going to make it.
eo: “Mi ne pensis ke mi estus atingi eksteren.

source: They followed me most of the way.
eo: Ili sekvis min plejparte de la vojo.

source: I could hear them buzzing.
eo: Mi povis aŭdi lin zumanta.

source: Buzzing and flitting around behind me.”
eo: Zumanta kaj flirtanta cirkaŭe maltantaŭ mi.”

source: “What happened?” the attendant demanded.
eo: “Kio okazis?” la servisto postulis.

source: “You in a wreck?
eo: “Ĉu vi estis en vrako?

source: A hold-up?”
eo: Rabado?”

source: Loyce shook his head wearily.
eo: Lojso kapneis lace.

source: “They have the whole town.
eo: “Ili havas la tuta urbeto.

source: The City Hall and the police station.
eo: La urbodomo kaj policejo.

source: They hung a man from the lamppost.
eo: Ili pendis viron de la lanterna stango.

source: That was the first thing I saw.
eo: Tio estis la unua afero ke mi vidis.

source: They’ve got all the roads blocked.
eo: Ili havas tuta la vojoj blokintaj.

source: I saw them hovering over the cars coming in.
eo: Mi vidis ilin ŝvebanta super la aŭtoj envenantaj.

source: About four this morning I got beyond them.
eo: Proksimume je kvara ĉi matene mi atingis preter ili.

source: I knew it right away.
eo: Mi sciis ĝin tuj.

source: I could feel them leave.
eo: Mi povis senti ke ilin foriri.

source: And then the sun came up.”
eo: Kaj tiam la sun levigis.”

source: The attendant licked his lip nervously.
eo: La servisto lekis sian lipon nervoze.

source: “You’re out of your head.
eo: “Vi estas ekstere via kapo.

source: I better get a doctor.”
eo: Mi devas akiri kuraciston.”

source: “Get me into Oak Grove,” Loyce gasped.
eo: “Konduku min en Kverkan Arbareton,” Lojso anehelis.

source: He sank down on the gravel.
eo: Li malviglĝis malsupren sur la gruzon.

source: “We’ve got to get started⁠—cleaning them out.
eo: “Ni devas komenci⁠—elpurigi ilin.

source: Got to get started right away.”
eo: Devas ek'komencu tuj.”

source: They kept a tape recorder going all the time he talked.
eo: Ili lasis magnetofonon funkcianta dum la tutan tempon kiam li parolis.

source: When he had finished the Commissioner snapped off the recorder and got to his feet.
eo: Kiam li finis, la Komisaro elŝaltis klake la magnetofonon kaj leviĝis sur siaj piedoj.

source: He stood for a moment, deep in thought.
eo: Li staris dum momento, profunda en penso.

source: Finally he got out his cigarettes and lit up slowly, a frown on his beefy face.
eo: Finfine li eligis siajn cigaredojn kaj ekbruligis unu malrapide, malrideto sur sia bovaĵa vizago.

source: “You don’t believe me,” Loyce said.
eo: “Vi ne kredas min,” diris Lojso.

source: The Commissioner offered him a cigarette.
eo: La Komisaro oferis al li cigaredon.

source: Loyce pushed it impatiently away.
eo: Lojso puŝis ĝin senpacience for.

source: “Suit yourself.” The Commissioner moved over to the window and stood for a time looking out at the town of Oak Grove.
eo: “Plaĉu vin mem.” La Komisaro transmoviĝis al la fenestro kaj staris dum kelka tempo vidiĝante ekstere al la urbeto Kverka Arbareto.

source: “I believe you,” he said abruptly.
eo: “Mi kredas min,” lie diris abrupte.

source: Loyce sagged.
eo: Lojso malvigliĝis.

source: “Thank God.”
eo: “Dankon al Dio.”

source: “So you got away.” The Commissioner shook his head.
eo: “Do vi eskapis.” La Komisaro kapneis.

source: “You were down in your cellar instead of at work.
eo: “Vi estis malsupre en via kelo anstataŭ ĉe via laborejo.

source: A freak chance.
eo: Tre nekutima ebleco.

source: One in a million.”
eo: Unu el miliono.”

source: Loyce sipped some of the black coffee they had brought him.
eo: Lojso trinketis iom da la nigran kafon ili portis al li.

source: “I have a theory,” he murmured.
eo: “Mi havas teorion,” li murmuris.

source: “What is it?”
eo: “Kio ĝi estas?”

source: “About them.
eo: “Pri ili.

source: Who they are.
eo: Kiu ili estas.

source: They take over one area at a time.
eo: Ili povprenas unuope po unu areon.

source: Starting at the top⁠—the highest level of authority.
eo: Komencante ĉe la supro⁠—la pli alta nivelo de aŭtoritato.

source: Working down from there in a widening circle.
eo: Laboranta malsupren de tie en larĝiĝanta cirklo.

source: When they’re firmly in control they go on to the next town.
eo: Kiam ili estas firme en kontrolo ili iros al la sekva urbeto.

source: They spread, slowly, very gradually.
eo: Ili disvastiĝas, malrapide, tre iom post iom.

source: I think it’s been going on for a long time.”
eo: Mi kredas ke ĝi daŭras delonge.”

source: “A long time?”
eo: “Longa tempo?”

source: “Thousands of years.
eo: “Miloj da jaroj.

source: I don’t think it’s new.”
eo: Mi ne pensas, ke ĝi estas nova.”

source: “Why do you say that?”
eo: “Kial vi diras tion?”

source: “When I was a kid.⁠ ⁠… A picture they showed us in Bible League.
eo: “Kiam mi estis infano.⁠ ⁠… Pentrajo oni montris al ni en Biblia Ligo.

source: A religious picture⁠—an old print.
eo: Religia pentrajo⁠—malnova presaĵo.

source: The enemy gods, defeated by Jehovah.
eo: La malamikaj dioj, venkitaj de Jehovaho.

source: Moloch, Beelzebub, Moab, Baalin, Ashtaroth⁠—”
eo: Moleĥo, Baalzebubo, Moabo, Baalo, Aŝtarino⁠—”

source: “So?”
eo: “Do?”

source: “They were all represented by figures.” Loyce looked up at the Commissioner.
eo: “Ĉiu ili reprezentatis per figuroj.” Lojso rigardis supren al la Komisaron.

source: “Beelzebub was represented as⁠—a giant fly.”
eo: “Baalzebubo estis reprezentanta kiel⁠—grandega muŝo.”

source: The Commissioner grunted.
eo: La Komisaro gruntis.

source: “An old struggle.”
eo: “Malnova lukto.”

source: “They’ve been defeated.
eo: “Ili estis venkitaj.

source: The Bible is an account of their defeats.
eo: La Biblio estas rakonto pri iliaj malvinkoj.

source: They make gains⁠—but finally they’re defeated.”
eo: Ili gajnas⁠—sed finfine ili estas venkitaj.”

source: “Why defeated?”
eo: “Kial venkitaj?”

source: “They can’t get everyone.
eo: “Ili ne povas teni ĉiuj.

source: They didn’t get me.
eo: Ili ne tenis min.

source: And they never got the Hebrews.
eo: Kaj ili neniam tenis la hebreojn.

source: The Hebrews carried the message to the whole world.
eo: La hebreoj portis la mesagon al la tuta mondo.

source: The realization of the danger.
eo: La rekono pri la danĝero.

source: The two men on the bus.
eo: La du viroj en la buso.

source: I think they understood.
eo: Mi pensas ke ili komprenis.

source: Had escaped, like I did.” He clenched his fists.
eo: Eskapis, kiel mi faris.” Li kunpremu liajn pugnojn.

source: “I killed one of them.
eo: “Mi mortigis unu de ilin.

source: I made a mistake.
eo: Mi faris eraron.

source: I was afraid to take a chance.”
eo: Mi timis ke preni ŝancon.”

source: The Commissioner nodded.
eo: La Komisaro kapsignis.

source: “Yes, they undoubtedly had escaped, as you did.
eo: “Jes, ili sendube estis eskapinta, kiel vi faris.

source: Freak accidents.
eo: Tre nekutimaj akcidentoj.

source: But the rest of the town was firmly in control.” He turned from the window.
eo: Sed la cetera de la urbeto estis firme en kontrolo.” Li turniĝis el la fenestro.

source: “Well, Mr. Loyce.
eo: “Nu, S-ro. Lojso.

source: You seem to have figured everything out.”
eo: Vi ŝajnis esti eltrovinta ĉion.”

source: “Not everything.
eo: “Ne ĉion.

source: The hanging man.
eo: La pendanta viro.

source: The dead man hanging from the lamppost.
eo: La morta viro pendanta de la lanterna stango.

source: I don’t understand that.
eo: Mi ne komprenas tion.

source: Why? Why did they deliberately hang him there?”
eo: Kial? Kial ili intence pendigis lin tie?”

source: “That would seem simple.” The Commissioner smiled faintly.
eo: “Tio ŝajnus simpla.” La Komisaro ridetis malforte.

source: “Bait.”
eo: “Logaĵo.”

source: Loyce stiffened.
eo: Lojso rigidiĝis.

source: His heart stopped beating.
eo: Lia koro ĉesis bati.

source: “Bait?
eo: “Logaĵo?

source: What do you mean?”
eo: Kion vi signifas?”

source: “To draw you out.
eo: “Por eltiri vin.

source: Make you declare yourself.
eo: Devigi vin, deklari vin.

source: So they’d know who was under control⁠—and who had escaped.”
eo: Tiel ili sciis kiu estis sub kontrolo⁠—kaj kiu estis eskapinta.”

source: Loyce recoiled with horror.
eo: Lojso reŝrumpis horore.

source: “Then they expected failures!
eo: “Do ili atendis malsukcesojn!

source: They anticipated⁠—” He broke off.
eo: Ili anticipis⁠—” Li ĉesis.

source: “They were ready with a trap.”
eo: “Ili estis preta kun kaptilo.”

source: “And you showed yourself.
eo: “Kaj vi montris vin mem.

source: You reacted.
eo: Vi reagis.

source: You made yourself known.” The Commissioner abruptly moved toward the door.
eo: Vi faris sin mem konata.” La Komisaro moviĝis abrupte al la pordon.

source: “Come along, Loyce.
eo: “Venu laŭ, Lojso.

source: There’s a lot to do.
eo: Estas multo por fari.

source: We must get moving.
eo: Ni devas ekmoviĝi.

source: There’s no time to waste.”
eo: Ne estas tempo por malŝpari.”

source: Loyce started slowly to his feet, numbed.
eo: Lojso komencis malrapide al lian piedojn, sensenta.

source: “And the man.
eo: “Kaj la viro.

source: Who was the man? I never saw him before.
eo: Kiu estis la viro? Mi neniam vidis lin antaŭe.

source: He wasn’t a local man.
eo: Li ne estis loka viro.

source: He was a stranger.
eo: Li estis fremdulo.

source: All muddy and dirty, his face cut, slashed⁠—”
eo: Tuta kota kaj grunda, lian vizaĝo tranĉita, tranĉita oblikve⁠—”

source: There was a strange look on the Commissioner’s face as he answered.
eo: Estis stranga apero sur la vizago de la Komisaro dum li respondis.

source: “Maybe,” he said softly, “you’ll understand that, too.
eo: “Eble,” li diris malforte, “vi komprenos tion, ankaŭ.

source: Come along with me, Mr. Loyce.” He held the door open, his eyes gleaming.
eo: Venu laŭ kun mi, S-ro. Lojso.” Li tenis la pordon malferma, sia okuloj brilanta.

source: Loyce caught a glimpse of the street in front of the police station.
eo: Lojso kaptis ekvidon de la strato antaŭ la policejo.

source: Policemen, a platform of some sort.
eo: Policanoj, platformo ia.

source: A telephone pole⁠—and a rope!
eo: Telefona stango⁠—kaj ŝnuro!

source: “Right this way,” the Commissioner said, smiling coldly.
eo: “Prave ĉi vojo,” la Komisaro diris, ridetanta malvarme.

source: As the sun set, the vice-president of the Oak Grove Merchants’ Bank came up out of the vault, threw the heavy time locks, put on his hat and coat, and hurried outside onto the sidewalk.
eo: Dum la suno mallevigis, la vica prezidanto de la Banko de Komercistoj de Kverka Arbareto eliris la banka kelo, jeta ŝlosis la pezajn tempigita ŝlosojn, surmetis sian ĉapelon kaj mantelon, kaj rapidis sur la trotuaron.

source: Only a few people were there, hurrying home to dinner.
eo: Nur kelkaj homoj estis tie, rapidantaj hejmen al vespermango.

source: “Good night,” the guard said, locking the door after him.
eo: “Bonan nokton,” la gardisto diris, ŝlosante la pordon post li.

source: “Good night,” Clarence Mason murmured.
eo: “Bonan nokton,” Klarenco Masono murmuris.

source: He started along the street toward his car.
eo: Li komencis laŭ la ŝtraton al sia aŭto.

source: He had been working all day down in the vault, examining the lay-out of the safety deposit boxes to see if there was room for another tier.
eo: Li estis laboranta la tuta tago en la banka kelo, kontrolinta la aranĝon de la sekuraj skatoloj por vidi se estis sufiĉa spaco por aldona vico.

source: He was glad to be finished.
eo: Li ĝojis, ĉar li estis finita.

source: At the corner he halted.
eo: Ĉe la stratangula li haltis.

source: The street lights had not yet come on.
eo: La strataj lumoj ankoraŭ ne ŝaltis.

source: The street was dim.
eo: Li strato estis malheleta.

source: Everything was vague.
eo: Ĉio estis svaga.

source: He looked around⁠—and froze.
eo: Li rigardis cirkaŭen⁠—kaj frostiĝis.

source: From the telephone pole in front of the police station, something large and shapeless hung.
eo: De la telefona stango antaŭ la policejo, io granda kaj senforma pendis.

source: It moved a little with the wind.
eo: Ĝi moviĝis iomete pro la vento.

source: Mason approached it warily.
eo: Masono proksimiĝas ĝin zorge.

source: He wanted to get home.
eo: Li volis reveni hejmen.

source: He was tired and hungry.
eo: Li estis laca kaj malsata.

source: He thought of his wife, his kids, a hot meal on the dinner table.
eo: Li pensis pri sia edzino, sia infanoj, varma manĝo sur la vespermanĝa tablo.

source: But there was something about the dark bundle, something ominous and ugly.
eo: Sed estis io pri la malhela fasko, io malbonaŭgura kaj malbela.

source: The light was bad; he couldn’t tell what it was.
eo: La lumo estis malbona; li ne povis identigi ĝin.

source: Yet it drew him on, made him move closer for a better look.
eo: Tamen ĝi altiris lin laŭ, devigas lin moviĝi pli proksime por pli bona vido.

source: The shapeless thing made him uneasy.
eo: La senforma aferaĉo maltrankviligis lin.

source: He was frightened by it.
eo: Li estis timiĝata pri ĝi.

source: Frightened⁠—and fascinated.
eo: Timiĝata⁠—kaj fascinata.

source: And the strange part was that nobody else seemed to notice it.
eo: Kaj la stranga parto estis, ke neniu alia ŝajnis rimarki ĝin.
